<?php

return [
    'welcome' => 'به فریمورک اختصاصی خوش آمدید 🎉',
    'login' => 'ورود به حساب کاربری',
    'register' => 'ثبت‌نام',
    'first_name' => 'نام',
    'last_name' => 'نام خانوادگی',
    'phone_number' => 'شماره موبایل',
    'password' => 'رمز عبور',
    'submit' => 'ارسال',
    'dashboard' => 'داشبورد',
    'dashboard_description' => 'به ناحیه کاربری خوش آمدید',
    'logout' => 'خروج',
    'hello_user' => 'سلام، :name',
    'login_success' => 'ورود با موفقیت انجام شد ✅',
    'logout_success' => 'با موفقیت خارج شدید ✅',
    'name_required' => 'نام خیلی کوتاه است.',
    'password_short' => 'رمز عبور باید حداقل ۶ کاراکتر باشد.',
    'phone_taken' => 'این شماره قبلاً ثبت شده است.',
    'user_save_error' => 'ذخیره کاربر با خطا مواجه شد.',
    'login_failed' => 'اطلاعات ورود اشتباه است.',
    'password_required' => 'رمز عبور نمی‌تواند خالی باشد.',

    'edit_profile' => 'ویرایش پروفایل',
    'first_name_short' => 'نام خیلی کوتاه است.',
    'save_changes' => 'ذخیره تغییرات',
    'profile_updated' => 'پروفایل با موفقیت به‌روزرسانی شد.',
    'save_error' => 'ذخیره اطلاعات با خطا مواجه شد.',

    'user_not_found' => 'کاربر پیدا نشد.',
    'user_profile' => 'پروفایل کاربر',

    'user_deleted' => 'کاربر با موفقیت حذف شد.',
    'delete_failed' => 'حذف کاربر با خطا مواجه شد.',

    'users_list' => 'لیست کاربران',
    'user_type' => 'نقش',
    'employee_service_list' => 'لیست خدمات',
    'select_services_for_employee' => 'سرویس های مورد نطر را انتخاب کنید',

    'active' => 'فعال',
    'inactive' => 'غیرفعال',
    'edit' => 'ویرایش',
    'editUser' => ' کاربر ویرایش',
    'delete' => 'حذف',
    'confirm_delete' => 'آیا مطمئن هستید که می‌خواهید این کاربر را حذف کنید؟',

    'validation_required' => ':field الزامی است.',
    'min_length' => 'حداقل طول باید :min کاراکتر باشد.',
    'field_first_name' => 'نام',
    'field_password' => 'رمز عبور',
    'field_phone_number' => 'شماره موبایل',
    'phone_invalid' => 'شماره موبایل نامعتبر است.',
//    'phone_invalid' => 'شماره موبایل باید ۱۱ رقم عددی باشد.',
    'user_updated' => 'کاربر مورد نظر با موفقیت بروزرسانی شد',

    'is_active' => 'فعال باشد',

    'redis_title' => 'محدودیت درخواست‌ها',
    'redis_heading' => 'تعداد درخواست‌ها بیش از حد مجاز است',
    'redis_message' => 'لطفاً کمی صبر کنید و بعداً دوباره تلاش کنید.',
    'redis_retry' => 'زمان باقی‌مانده تا رفع محدودیت: :rtime ثانیه',

    'back_to_dashboard' => 'بازگشت',
    'my_profile' => 'پروفایل من',

];
