<?php

return [
    'welcome' => 'به فریمورک اختصاصی خوش آمدید 🎉',
    'login' => 'ورود به حساب کاربری',
    'register' => 'ثبت‌نام',
    'first_name' => 'نام',
    'last_name' => 'نام خانوادگی',
    'phone_number' => 'شماره موبایل',
    'password' => 'رمز عبور',
    'submit' => 'ارسال',
    'dashboard' => 'داشبورد',
    'logout' => 'خروج',
    'hello_user' => 'سلام، :name',
    'login_success' => 'ورود با موفقیت انجام شد ✅',
    'logout_success' => 'با موفقیت خارج شدید ✅',
    'name_required' => 'نام خیلی کوتاه است.',
    'phone_invalid' => 'شماره موبایل باید ۱۱ رقم عددی باشد.',
    'password_short' => 'رمز عبور باید حداقل ۶ کاراکتر باشد.',
    'phone_taken' => 'این شماره قبلاً ثبت شده است.',
    'user_save_error' => 'ذخیره کاربر با خطا مواجه شد.',
    'login_failed' => 'اطلاعات ورود اشتباه است.',
    'password_required' => 'رمز عبور نمی‌تواند خالی باشد.',
];
